In [ ]:
#1) Collection of functions, there are some standard functions: numbers, string, list, 
#tuple, set, and dictionary. They all deal with sequences. Numbers category deals with 
#numerical sequences, list orders the sequence, tuple is similar to list but cannot be changed,
#string sequence unicodes,set are both unordered and unindexed, while dictionary is an 
#unordered collection of key-value pairs.

In [15]:
#2)
emp_dict= {"name": ['Nancy','Andrew','Janet','Margaret','Steven'], 
            'monthly_salary':[5000,4000,6000,3000,2000], 'zip':[98122,98401,98033,98052,98051]}

In [16]:
import pandas as pd

In [18]:
emp_dict

{'name': ['Nancy', 'Andrew', 'Janet', 'Margaret', 'Steven'],
 'monthly_salary': [5000, 4000, 6000, 3000, 2000],
 'zip': [98122, 98401, 98033, 98052, 98051]}

In [19]:
df=pd.DataFrame(emp_dict)

In [28]:
#3)
print(df.iloc[0:1])

    name  monthly_salary    zip
0  Nancy            5000  98122

In [31]:
#4)
print(df.iloc[4:5])

     name  monthly_salary    zip
4  Steven            2000  98051

In [33]:
#5)
print('The Shape is:',df.shape)
print('The Size is:',df.size)

The Shape is: (5, 3)
The Size is: 15

In [37]:
#6)
print(df['monthly_salary'].mean())

4000.0

In [45]:
#7)
df.sort_values(by='name',ascending=0)

       name  monthly_salary    zip
4    Steven            2000  98051
0     Nancy            5000  98122
3  Margaret            3000  98052
2     Janet            6000  98033
1    Andrew            4000  98401

In [50]:
#8)
df.query('zip==98033')

    name  monthly_salary    zip
2  Janet            6000  98033

In [54]:
#9)
df['annual_salary']= df['monthly_salary'] *12

In [55]:
df

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [58]:
#10)
df.rename(columns={'name':'firstname'})

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [64]:
#11)
emp_info= {"firstname": ['Nancy','Andrew','Janet','Margaret','Steven'], 
            'annual_salary':[60000,48000,72000,36000,24000], 'zip':[98122,98401,98033,98052,98051]}

In [65]:
emp_info

{'firstname': ['Nancy', 'Andrew', 'Janet', 'Margaret', 'Steven'],
 'annual_salary': [60000, 48000, 72000, 36000, 24000],
 'zip': [98122, 98401, 98033, 98052, 98051]}

In [66]:
df1=pd.DataFrame(emp_info)

In [67]:
#11)
df1

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margaret          36000  98052
4    Steven          24000  98051

In [68]:
#12)
df1['firstname'].head()

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [69]:
#13)
df1.drop('annual_salary', axis=1)

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051